documenting project 2
